#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repository_rust_lib["ccsds"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIuv5Ic4B9nwn"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_lib["ccsds"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIuv5Ic4B9nwq"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_lib["common"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIsTQ884B8rpd"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_lib["common"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIsTQ884B8rpa"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["assets"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFCB84B7Zo5"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["assets"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFCB84B7Zo8"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["atc"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJWDFpM4CLG4F"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["atc"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJWDFpM4CLG4H"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOH_aGzM4Bu98o"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOH_aGzM4Bu98q"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["compliance"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFCFc4B7Zpr"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["compliance"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFCFc4B7Zps"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["contact"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJSnQis4CKHN0"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["contact"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJSnQis4CKHNz"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["devops-test"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOInhcK84B6TnH"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["devops-test"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOInhcK84B6TnI"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["discovery"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJWEJ1s4CLHS1"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["discovery"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJWEJ1s4CLHSz"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["docs"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJSxJG84CKKOJ"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["docs"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJSxJG84CKKOH"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["gis"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJf55jM4CN9iW"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["gis"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOJf55jM4CN9iX"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cargo-husky/hooks/README.md"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cargo-husky/hooks/README.md"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cargo-husky/hooks/commit-msg"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cargo-husky/hooks/commit-msg"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cargo-husky/hooks/pre-commit"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cargo-husky/hooks/pre-push"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cargo-husky/hooks/pre-push"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cargo/config.toml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cargo/config.toml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".commitlintrc.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".commitlintrc.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".cspell.config.yaml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".cspell.config.yaml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".dockerignore"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".dockerignore"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".editorconfig"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".editorconfig"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".env.base"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".env.base"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/CODEOWNERS"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/CODEOWNERS"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/api_docs.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/api_docs.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/autosquash.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/autosquash.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/nightly.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/nightly.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/post_release.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/post_release.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/python_ci.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/python_ci.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/release.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/release.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/rust_ci.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/rust_ci.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".github/workflows/sanity_checks.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".github/workflows/sanity_checks.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".gitignore"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".gitignore"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/base.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/base.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/commitlint.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/commitlint.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/cspell.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/cspell.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/docker.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/docker.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/editorconfig.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/editorconfig.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/env.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/env.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/markdown.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/markdown.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/python.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/python.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/rust.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/rust.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".make/toml.mk"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".make/toml.mk"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files[".taplo.toml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = ".taplo.toml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files["CONTRIBUTING.md"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = "CONTRIBUTING.md"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files["Dockerfile"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = "Dockerfile"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files["LICENSE"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = "LICENSE"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files["Makefile"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = "Makefile"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].data.github_repository_file.files["docker-compose.yml"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository_file" "files" {
      + branch         = "develop"
      + commit_author  = (known after apply)
      + commit_email   = (known after apply)
      + commit_message = (known after apply)
      + commit_sha     = (known after apply)
      + content        = (known after apply)
      + file           = "docker-compose.yml"
      + id             = (known after apply)
      + ref            = (known after apply)
      + repository     = "svc-itest"
      + sha            = (known after apply)
    }

  # module.repository_rust_svc["itest"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOKkego84CkXBX"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
            # (6 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.repository_rust_svc["itest"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOKkego84CkXBd"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
            # (6 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.repository_rust_svc["itest"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                          = "svc-itest"
        name                        = "svc-itest"
      + topics                      = (known after apply)
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOICuHTM4Bvld_"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOICuHTM4BvleC"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["telemetry"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFB9M4B7Zo0"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_rust_svc["telemetry"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      + force_push_bypassers            = [
          + "/arrow-github-bot",
        ]
        id                              = "BPR_kwDOIpFB9M4B7Zox"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 35 to change, 0 to destroy.

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*